--
-- Author: xd
-- Date: 2015-12-02 10:31:12
--

ErrorCode = {
	 -- 公共错误 1
    [10000] = " NotOk message 未定义",
    [10001] = " 参数错误",
    [10002] = " op错误",
    [10003] = " game_sso:错误",
    [10004] = " uid错误",
    [10005] = " 用户名密码错误",
    [10006] = " 账号封停",
    [10007] = " 账号禁言",
    [10008] = " 送达Id错误",
    [10009] = " 多点登陆",
    [10010] = " 模板id不存在",
    [10011] = " 模板数据错误",
    [10012] = " 没有达到激活条件",
    [10013] = " 玩家等级不足",
    [10014] = " 物品数量不足",
    [10015] = " 金币不足",
    [10016] = " 法力不足",
    
    -- 账户系统 2
    [20101] = "账户被占用",
    
    --法宝系统
    [40101] = "法宝不存在",
    [40102] = "法宝已被分解",
    [40103] = "法宝境界不足",
    [40301] = "法宝已满星",
    [40501] = "法宝已达到最高境界",
    [40502] = "法宝等级不足以进阶",
    [40503] = "主角境界不足",
    --神器系统
    [50101] = "神器已存在",
    [50102] = "神器不存在",
    [50201] = "神器状态错误",
    [50202] = "神器格数不足",
    [50203] = "神器空间不足",
    --境界系统
    [60101] = "境界不存在",
    [60102] = "节点不存在",
    [60103] = "节点已达满级",
    [60104] = "节点消耗模板不存在",
    [60105] = "父节点未激活",
    [60201] = "精纯不存在",
    [60202] = "精纯已经存在",
}



return ErrorCode
